Конфигурация/InformationRegisters/УсловияДоговоровАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияДоговоровАренды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДоговораАренды</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровАренды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияДоговоровАренды/Ext/ManagerModule.bsl
Процедура УстановитьВидДоговораАренды(Период, Договор, ВидДоговораАренды) Экспорт
	//добавить проверку наличия документов с отказом
	
	УсловияДоговоровАренды = РегистрыСведений.УсловияДоговоровАренды.СоздатьМенеджерЗаписи();
	УсловияДоговоровАренды.Период			= Период;
	УсловияДоговоровАренды.Организация		= Договор.Организация;
	УсловияДоговоровАренды.Договор			= Договор.Ссылка;
	УсловияДоговоровАренды.ВидДоговораАренды	= ВидДоговораАренды;
	УсловияДоговоровАренды.Записать();
	
	
КонецПроцедуры
